# CustomFieldService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..CustomFieldService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Autodesk Internal: The service for updating the custom fields of a schedule.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId CustomFieldService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CustomFieldService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ CustomFieldService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace